!define ENCODING_NAME "Unicode" ; 编码名称
!define PLUGIN_NAME "UseNsisPlugin" ; 定义插件名称
!define SEPARATOR "------------------------------------" ; 分隔符

; 使用编码
!if "${ENCODING_NAME}" == "Unicode"
  Unicode true ; Unicode
!else
  Unicode false ; Ansi
!endif

Name "${PLUGIN_NAME}_TEST" ; 测试程序名称
OutFile "${PLUGIN_NAME}.exe" ; 可执行文件名称
SetCompress off ; 不压缩
RequestExecutionLevel user ; 普通权限
!addplugindir ".\addplugin" ; 插件目录

; 打印首个字符和长度
!macro PrintCharAndLen VAL
    StrLen $1 "${VAL}"
    StrCpy $2 "${VAL}" 1 0
    DetailPrint "$2($1)"
!macroend

Section
	DetailPrint "${ENCODING_NAME}"
	DetailPrint ${SEPARATOR}
	
	Call Plugin1
	Call Plugin2
	Call Plugin3
	Call Plugin4
	Call Plugin5
	Call Plugin6
SectionEnd

# 定义函数：调用插件1的函数
Function Plugin1
	DetailPrint ""
	DetailPrint "Add 200 99"
	${PLUGIN_NAME}::Add 200 99
	Pop $0 ; 299
	DetailPrint $0
	
	DetailPrint ""
	DetailPrint "StrAdd 200 99"
	${PLUGIN_NAME}::StrAdd 200 99
	Pop $0 ; 20099
	DetailPrint $0
	DetailPrint ${SEPARATOR}
FunctionEnd

Function Plugin2
	DetailPrint ""
	DetailPrint "MoveWindow ct"
	MessageBox MB_YESNO|MB_ICONQUESTION "是否将窗口移动到顶部居中" IDYES yes IDNO no
	yes:
		DetailPrint "移动"
		${PLUGIN_NAME}::MoveWindow ct
		Goto next
	no:
		DetailPrint "不移动"
	next:
		DetailPrint ${SEPARATOR}
FunctionEnd

Function Plugin3
	DetailPrint ""
	DetailPrint "（测试边界）Boundary"
	;栈推送 1024个1和我
	Push "1111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111"
	Push "我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我我"
	; 变量设置1024个2和你
	StrCpy $1 "2222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222222"
	StrCpy $R1 "你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你你"
	${PLUGIN_NAME}::Boundary
	DetailPrint "打印栈信息"
	Pop $0 ; 他...
	!insertmacro PrintCharAndLen $0
	Pop $0 ; 3...
	!insertmacro PrintCharAndLen $0
	Pop $0 ; 我（1023）
	DetailPrint $0
	Pop $0 ; 1（1023）
	DetailPrint $0
	DetailPrint "打印变量信息"
	!insertmacro PrintCharAndLen $R9 ; 她...
	!insertmacro PrintCharAndLen $9 ; 4...
	DetailPrint $R8 ; 你（1023）
	DetailPrint $8 ; 2（1023）
	DetailPrint ${SEPARATOR}
FunctionEnd

Function Plugin4
	DetailPrint ""
	MessageBox MB_YESNO|MB_ICONQUESTION "完成后是否自动关闭" /SD IDYES IDNO no ; 默认 yes
		DetailPrint "AutoClose 1"
		${PLUGIN_NAME}::AutoClose 1
		Goto next
	no:
		DetailPrint "AutoClose 0"
		${PLUGIN_NAME}::AutoClose 0
	next:
		DetailPrint ${SEPARATOR}
FunctionEnd

Function Plugin5
	DetailPrint ""
	MessageBox MB_YESNO|MB_ICONQUESTION "是否要通过插件调用NSIS函数" /SD IDNO IDYES yes ; 默认 no
		DetailPrint "不通过插件调用NSIS函数"
		Goto next
	yes:
		GetFunctionAddress $0 "CalledByPlugin5" ; 获取函数地址
		${PLUGIN_NAME}::CallNsisFunction "Hello" $0 ; 调用插件传入消息和函数地址
		Pop $0
		DetailPrint "调用插件函数 -> 插件调用NSIS函数结果：$0"
	next:
		DetailPrint ${SEPARATOR}
FunctionEnd
; 被插件调用的函数
Function CalledByPlugin5
	Pop $0
	DetailPrint "被插件调用：$0"
	MessageBox MB_OK "被插件调用：$0"
FunctionEnd

Function Plugin6
	DetailPrint ""
	
	MessageBox MB_YESNO|MB_ICONQUESTION "是否要在插件回调中显示弹窗" IDYES yes IDNO no
	yes:
		StrCpy $1 true
		Goto next
	no:
		StrCpy $1 false
	next:
		DetailPrint "是否要在插件回调中显示弹窗：$1"
	
	DetailPrint "注册插件回调"
	${PLUGIN_NAME}::RegisterCallback $1
	Pop $0
	DetailPrint "注册插件回调结果：$0"
	
	DetailPrint "二次注册插件回调"
	${PLUGIN_NAME}::RegisterCallback $1
	Pop $0
	DetailPrint "二次注册插件回调结果：$0"
FunctionEnd
